#### OpenTofu Format: success
#### OpenTofu Init: success
#### OpenTofu Validate: success
#### OpenTofu Plan: success

<details><summary>Show Plan</summary>

```terraform
module.github_oidc.aws_iam_policy.lambda_deployment: Refreshing state... [id=arn:aws:iam::043189681060:policy/GitHubActionsLambdaDeployment]
module.github_oidc.aws_iam_openid_connect_provider.github: Refreshing state... [id=arn:aws:iam::043189681060:oidc-provider/token.actions.githubusercontent.com]
module.github_oidc.aws_iam_role.lambda_deployment: Refreshing state... [id=ZeroVerifyGitHubActionsLambdaDeployment]
module.github_oidc.aws_iam_role.infrastructure: Refreshing state... [id=ZeroVerifyGitHubActionsInfra]
module.github_oidc.aws_iam_role_policy_attachment.lambda_deployment_policy: Refreshing state... [id=ZeroVerifyGitHubActionsLambdaDeployment-20260318183740123100000002]
module.github_oidc.aws_iam_role_policy_attachment.infrastructure_admin: Refreshing state... [id=ZeroVerifyGitHubActionsInfra-20260318183740036000000001]

OpenTofu used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

OpenTofu will perform the following actions:

  # module.dynamodb.aws_dynamodb_table.bit_indices will be created
  + resource "aws_dynamodb_table" "bit_indices" {
      + arn              = (known after apply)
      + billing_mode     = "PAY_PER_REQUEST"
      + hash_key         = "bit_index"
      + id               = (known after apply)
      + name             = "zeroverify-bit-indices"
      + read_capacity    = (known after apply)
      + stream_arn       = (known after apply)
      + stream_enabled   = true
      + stream_label     = (known after apply)
      + stream_view_type = "NEW_AND_OLD_IMAGES"
      + tags             = {
          + "ManagedBy" = "OpenTofu"
          + "Project"   = "ZeroVerify"
        }
      + tags_all         = {
          + "ManagedBy" = "OpenTofu"
          + "Project"   = "ZeroVerify"
        }
      + write_capacity   = (known after apply)

      + attribute {
          + name = "bit_index"
          + type = "N"
        }

      + point_in_time_recovery (known after apply)

      + replica {
          + arn                    = (known after apply)
          + kms_key_arn            = (known after apply)
          + point_in_time_recovery = false
          + propagate_tags         = false
          + region_name            = "us-west-2"
          + stream_arn             = (known after apply)
          + stream_label           = (known after apply)
        }

      + server_side_encryption (known after apply)

      + ttl (known after apply)
    }

  # module.dynamodb.aws_dynamodb_table.credentials will be created
  + resource "aws_dynamodb_table" "credentials" {
      + arn              = (known after apply)
      + billing_mode     = "PAY_PER_REQUEST"
      + hash_key         = "subject_id"
      + id               = (known after apply)
      + name             = "zeroverify-credentials"
      + range_key        = "credential_id"
      + read_capacity    = (known after apply)
      + stream_arn       = (known after apply)
      + stream_enabled   = true
      + stream_label     = (known after apply)
      + stream_view_type = "NEW_AND_OLD_IMAGES"
      + tags             = {
          + "ManagedBy" = "OpenTofu"
          + "Project"   = "ZeroVerify"
        }
      + tags_all         = {
          + "ManagedBy" = "OpenTofu"
          + "Project"   = "ZeroVerify"
        }
      + write_capacity   = (known after apply)

      + attribute {
          + name = "credential_id"
          + type = "S"
        }
      + attribute {
          + name = "subject_id"
          + type = "S"
        }

      + point_in_time_recovery (known after apply)

      + replica {
          + arn                    = (known after apply)
          + kms_key_arn            = (known after apply)
          + point_in_time_recovery = false
          + propagate_tags         = false
          + region_name            = "us-west-2"
          + stream_arn             = (known after apply)
          + stream_label           = (known after apply)
        }

      + server_side_encryption (known after apply)

      + ttl {
          + attribute_name = "expires_at"
          + enabled        = true
        }
    }

  # module.dynamodb.aws_dynamodb_table_item.bit_indices_metadata will be created
  + resource "aws_dynamodb_table_item" "bit_indices_metadata" {
      + hash_key   = "bit_index"
      + id         = (known after apply)
      + item       = jsonencode(
            {
              + bit_index = {
                  + N = "-1"
                }
              + max_index = {
                  + N = "0"
                }
            }
        )
      + table_name = "zeroverify-bit-indices"
    }

  # module.lambda_roles.aws_iam_role.bitstring_updater_lambda will be created
  + resource "aws_iam_role" "bitstring_updater_lambda" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "lambda.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + description           = "Execution role for bitstring updater Lambda"
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "zeroverify-bitstring-updater-lambda"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "ManagedBy" = "OpenTofu"
          + "Project"   = "ZeroVerify"
        }
      + tags_all              = {
          + "ManagedBy" = "OpenTofu"
          + "Project"   = "ZeroVerify"
        }
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # module.lambda_roles.aws_iam_role.free_lambda will be created
  + resource "aws_iam_role" "free_lambda" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "lambda.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + description           = "Execution role for free Lambda"
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "zeroverify-free-lambda"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "ManagedBy" = "OpenTofu"
          + "Project"   = "ZeroVerify"
        }
      + tags_all              = {
          + "ManagedBy" = "OpenTofu"
          + "Project"   = "ZeroVerify"
        }
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # module.lambda_roles.aws_iam_role.issuer_lambda will be created
  + resource "aws_iam_role" "issuer_lambda" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "lambda.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + description           = "Execution role for issuer Lambda"
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "zeroverify-issuer-lambda"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "ManagedBy" = "OpenTofu"
          + "Project"   = "ZeroVerify"
        }
      + tags_all              = {
          + "ManagedBy" = "OpenTofu"
          + "Project"   = "ZeroVerify"
        }
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # module.lambda_roles.aws_iam_role.revocation_lambda will be created
  + resource "aws_iam_role" "revocation_lambda" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "lambda.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + description           = "Execution role for revocation processor Lambda"
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "zeroverify-revocation-lambda"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "ManagedBy" = "OpenTofu"
          + "Project"   = "ZeroVerify"
        }
      + tags_all              = {
          + "ManagedBy" = "OpenTofu"
          + "Project"   = "ZeroVerify"
        }
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # module.lambda_roles.aws_iam_role_policy.bitstring_updater_lambda will be created
  + resource "aws_iam_role_policy" "bitstring_updater_lambda" {
      + id          = (known after apply)
      + name        = "bitstring-updater-lambda-policy"
      + name_prefix = (known after apply)
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "logs:CreateLogGroup",
                          + "logs:CreateLogStream",
                          + "logs:PutLogEvents",
                        ]
                      + Effect   = "Allow"
                      + Resource = "arn:aws:logs:*:*:*"
                      + Sid      = "CloudWatchLogs"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + role        = (known after apply)
    }

  # module.lambda_roles.aws_iam_role_policy.free_lambda will be created
  + resource "aws_iam_role_policy" "free_lambda" {
      + id          = (known after apply)
      + name        = "free-lambda-policy"
      + name_prefix = (known after apply)
      + policy      = (known after apply)
      + role        = (known after apply)
    }

  # module.lambda_roles.aws_iam_role_policy.issuer_lambda will be created
  + resource "aws_iam_role_policy" "issuer_lambda" {
      + id          = (known after apply)
      + name        = "issuer-lambda-policy"
      + name_prefix = (known after apply)
      + policy      = (known after apply)
      + role        = (known after apply)
    }

  # module.lambda_roles.aws_iam_role_policy.revocation_lambda will be created
  + resource "aws_iam_role_policy" "revocation_lambda" {
      + id          = (known after apply)
      + name        = "revocation-lambda-policy"
      + name_prefix = (known after apply)
      + policy      = (known after apply)
      + role        = (known after apply)
    }

  # module.secrets.aws_secretsmanager_secret.baby_jubjub_private_key will be created
  + resource "aws_secretsmanager_secret" "baby_jubjub_private_key" {
      + arn                            = (known after apply)
      + description                    = "Baby Jubjub EdDSA private key for credential signing"
      + force_overwrite_replica_secret = false
      + id                             = (known after apply)
      + name                           = "zeroverify/baby-jubjub-private-key"
      + name_prefix                    = (known after apply)
      + policy                         = (known after apply)
      + recovery_window_in_days        = 30
      + tags                           = {
          + "ManagedBy" = "OpenTofu"
          + "Project"   = "ZeroVerify"
        }
      + tags_all                       = {
          + "ManagedBy" = "OpenTofu"
          + "Project"   = "ZeroVerify"
        }

      + replica (known after apply)
    }

  # module.secrets.aws_secretsmanager_secret.hmac_key will be created
  + resource "aws_secretsmanager_secret" "hmac_key" {
      + arn                            = (known after apply)
      + description                    = "HMAC key for credential verification"
      + force_overwrite_replica_secret = false
      + id                             = (known after apply)
      + name                           = "zeroverify/hmac-key"
      + name_prefix                    = (known after apply)
      + policy                         = (known after apply)
      + recovery_window_in_days        = 30
      + tags                           = {
          + "ManagedBy" = "OpenTofu"
          + "Project"   = "ZeroVerify"
        }
      + tags_all                       = {
          + "ManagedBy" = "OpenTofu"
          + "Project"   = "ZeroVerify"
        }

      + replica (known after apply)
    }

  # module.secrets.aws_secretsmanager_secret_version.baby_jubjub_private_key will be created
  + resource "aws_secretsmanager_secret_version" "baby_jubjub_private_key" {
      + arn                  = (known after apply)
      + has_secret_string_wo = (known after apply)
      + id                   = (known after apply)
      + secret_id            = (known after apply)
      + secret_string        = (sensitive value)
      + secret_string_wo     = (write-only attribute)
      + version_id           = (known after apply)
      + version_stages       = (known after apply)
    }

  # module.secrets.aws_secretsmanager_secret_version.hmac_key will be created
  + resource "aws_secretsmanager_secret_version" "hmac_key" {
      + arn                  = (known after apply)
      + has_secret_string_wo = (known after apply)
      + id                   = (known after apply)
      + secret_id            = (known after apply)
      + secret_string        = (sensitive value)
      + secret_string_wo     = (write-only attribute)
      + version_id           = (known after apply)
      + version_stages       = (known after apply)
    }

Plan: 15 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so OpenTofu can't
guarantee to take exactly these actions if you run "tofu apply" now.

```

</details>

Pushed by: @antonsakhanovych